# WireSizeSet Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
WireSizeSet Constructor
WireSizeSet Class See Also
---
Initializes a new instance of the WireSizeSet class
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public WireSizeSet()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
WireSizeSet()
```

# See Also
WireSizeSet Class
Autodesk.Revit.DB.Electrical Namespace